
/*Да се разработи програма тип „меню” за поддържане на информация за екскурзии със следните изисквания:

1. Данните за екскурзиите се съхраняват в двоични файлове. За всяка екскурзия се пазят следните данни:

Уникален код (буква и цифри); char cod [10]

Дата на заминаване (проверка за допустимост на датата) - записана във формата ДД.ММ.ГГГГ; int ear

Продължителност в дни - цяло число; Цена - реално число;

2. Да се извършват следните обработки:

а) добавяне на нова екскурзия;

б) извеждане на данните за най-дългата екскурзия;

в) извеждане информацията за всички екскурзии с изтекла дата на заминаване (текущата дата се задава от потребителя);

г) изтриване на данните за екскурзия с посочен код. о 50 символен низ; Режисьор - до 50 символен низ; Продължителност - реално число;
 Година - цяло число;*/


#include "hfile.h"


int main(){
    FILE *fp=NULL;
    menu(fp);
   
}   