/*Направете глобална константа pi = 3.14, както правихме в
предишния урок. Напишете функция, която изчислява площта на кръг, на
която като параметър подаваме радиуса и връщаме площта на кръга.
Използвайте глобалната константа pi, за да извършите изчисленията.
Извикайте функцията в main() и покажете резултата.
*/
#include<stdio.h>
float g_PI;

float area(float r)
{
    return g_PI*r*r;
}

int main(void){
    float r;
    scanf("%f",&r);
    printf("areaSize=%f\n",area(r));

    
}
float g_PI=3.14;