/*Имаме 2 сортирани масиви А и В с по 88 елемента.
Образувайте масив С с 2х88 елемента образуван от смесването на А и В,
така че С да съдържа елементите на А и В, но да е подреден и да не се
налага да го сортираме отново.*/


#include <stdio.h>
int main(){
    int i;
    int j=0;
    int p=0;
    int a[4]={1,2,4,5};
    int b[4]={3,6,7,8};
    int c[8]={0};

    for(i=0,j;p<8;){
        if(a[i]=='\0'){
            c[p]=b[j];
          
        }
        else if(b[j]=='\0'){
            c[p]=a[i];

            
        }
        else if(a[i]<b[j]){
            c[p]=a[i];
            i++;
        }
        else if(a[i]>b[j]){
            c[p]=b[j];
            j++;
        }
         
    p++;

    }
    for(p=0;p<8;p++){
        printf("%d ",c[p]);
    }

}
