/*Напишете функцията int linSearch(int a[], int l, int d),
която получава като първи аргумент началото на масив а, втория
аргумент е дължината на масива, а третия аргумент е числото,
което търсим. Претърсете масива елемент по елемент и ако
някой елемент съвпада с търсеното число върнете позицията на
която се намира този елемент. В противен случай върнете – 1.*/
#include <stdio.h>

int linSearch(int a[], int l, int d);
int main(void){
    int a[13]={20,10,30,2,3,4,1,1222,231,13,213,5,923};
   printf("%d position", linSearch(a,13,5));
}

int linSearch(int a[], int l, int d){
    int i;
    for(i=0;i<=l;i++){
        if(a[i]==d){
            return i;
        }
    
    }
    return -1;
}