/*Задача 10. Напишете програма на С, която съдържа 3 функции,
изнесете прототипите им в отделен .h файл.
1. Първата функция да калкулира най-малко общо кратно на две положителни
числа.
2. Втората функция връща абсолютна стойност на числата (положителната
стойност на числата).
a. Трябва да може да приеме като параметър float и да върне float.
b. Тествайте с инт и float.
3. Напишете функция, която калкулира корен квадратен от число.
a. Проверете дали резултатът е отрицателно число и върнете -1.
b. Използвайте втората си функция, за да обърнете числото в положително и
да намерите корен квадратен от него*/
#include "20210129_10.h"
#include <stdio.h>
int main(void){
    float c;
    obshtoKratno();
    printf("Test na absolutna stoinost\n");
    scanf("%f",&c);
    printf("|%f|=%f\n",c,absolutnaStoinost(c));
    square(c);
}