/*Напишете програма, която умножава 2 числа, като
използва пойнтер-и.
Пойнтер-ите не са страшни. Дефинират се като
тип *Х и се използват като *Х. Както променливите,
но със * отпред (и 1 наум!).
Продължение: Опитайте да умножите 2 променливи от
различен тип, използвайки пойнтери*/

#include <stdio.h>

int main(){
    int a=10;
    float y=4.5;
    int *ptra=&a;
    float *ptry=&y;
   /* printf("*ptra mult *ptry = %d\n" ,*ptra * *ptry);  error ! */
    printf("(float)*ptra mult *ptry = %f\n" ,*ptra * *ptry);

}